app/controllers/comments_controller.rb

  def index
    @comments = Comment.all
---
SELECT * FROM "comments"

  def show
    @comment = Comment.find(params[:id])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 1)

  def edit
    @comment = Comment.find(params[:id])
---
SELECT * FROM "comments" WHERE ("comments"."id" = 1)

  def create
    @comment = Comment.new(params[:comment])
		@comment.song = Song.find(1)
    respond_to do |format|
      if @comment.save
---
SELECT * FROM "songs" WHERE ("songs"."id" = 1)
INSERT INTO "comments" ("created_at", "body", "updated_at", "song_id") VALUES('2010-04-20 17:25:53', 'nigga', '2010-04-20 17:25:53', 1)

  def destroy
    @comment = Comment.find(params[:id])
    @comment.destroy
---
SELECT * FROM "comments" WHERE ("comments"."id" = 1)
DELETE FROM "comments" WHERE "id" = 1