app/controllers/replyships_controller.rb

  def index
    @replyships = Replyship.all
---
SELECT * FROM "replyships"

  def show
    @replyship = Replyship.find(params[:id])
---
SELECT * FROM "replyships" WHERE ("replyships"."id" = 1)

  def new
    #@replyship = Replyship.new
    @comment = Comment.new(:song_id => params[:song_id])
		@replyship = Comment.find(params[:comment_id]).replyships.build
---
SELECT * FROM "comments" WHERE ("comments"."id" = 4)

  def create
    @replyship = Replyship.new(params[:replyship])

    respond_to do |format|
      if @replyship.save
---
INSERT INTO "replyships" ("created_at", "updated_at", "reply_id", "comment_id") VALUES('2010-04-20 18:10:54', '2010-04-20 18:10:54', 1, 2)

  def destroy
    @replyship = Replyship.find(params[:id])
    @replyship.destroy
---
SELECT * FROM "replyships" WHERE ("replyships"."id" = 2)
DELETE FROM "replyships" WHERE "id" = 2