app/controllers/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT * FROM "songs"

  def show
    @song = Song.find(params[:id])
---
SELECT * FROM "songs" WHERE ("songs"."id" = 1)

  def create
    @song = Song.new(params[:song])
		@song.user = current_user
    respond_to do |format|
      if @song.save
---
INSERT INTO "songs" ("created_at", "title", "updated_at", "user_id", "description") VALUES('2010-04-20 17:25:37', 'test', '2010-04-20 17:25:37', 1, 'test')