app/controllers/users_controller.rb

INSERT INTO "users" ("name", "single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "username", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "last_login_at", "email") VALUES('Andreas Franzen', 'zHoIAwbqsXzcXHx8-zUk', '2010-04-20 15:28:08', '2010-04-20 15:28:08', 'bea8fdab5131e8e22e2268655e9c49c9fa66a9395534724b4ccdbb250420c049d6f5ffcdcd4a083389d517269dc1f8d073c98e74f5f9bd46474393c406235803', 'RRGezMCjz2OrccnG90wy', '2010-04-20 15:28:08', 'triptec', 0, '127.0.0.1', 'NUB__xHWDBgNWOnTc2wQ', '2010-04-20 15:28:07', 'b7630e0a1790a8de57bcb0c2499983019b20b7fc3a66cfc9ca87a63ba9e545ff65e25e71a3faeaeb4faa79197d4614fdacfc06cd0f2f77b75477829ee061ee4a', 1, NULL, NULL, 'triptec@gmail.com')
---
  def create
    @user = User.new(params[:user])
    @user.save do |result|

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def show
		@title = "Profile: " + @user.username
    @songs = Song.find(:all, :order => "created_at DESC", :conditions => {:user_id => @user})